configuration/src/InformationRegisters/Участники/Участники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Участники</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Скрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектНаблюдения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>DefinedType.ПолучательОповещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиУчастников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ИзбранныеОбъекты/ИзбранныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбранныеОбъекты</name>
  <comment>Хранит объекты, которые пользователь добавил в избранное</comment>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.ТипыИзбранныхОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектИзбранного</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ТипыИзбранныхОбъектов/ТипыИзбранныхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзбранныхОбъектов</name>
  <enumValues>
    <name>Пользователи</name>
  </enumValues>
  <enumValues>
    <name>Направления</name>
  </enumValues>
  <enumValues>
    <name>Системы</name>
  </enumValues>
  <enumValues>
    <name>Филиалы</name>
  </enumValues>
  <enumValues>
    <name>ГруппыЗаказчиков</name>
  </enumValues>
  <enumValues>
    <name>Продукты</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>RocketChatID</name>
    <comment>Имя пользователя RocketChat (значение поля &quot;username&quot;)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата и время создания пользователя</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРедмайн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьВсеОповещения</name>
    <comment>Хранит признак, что пользователь отключил оповещения в настройках.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольВОтделеIT</name>
    <comment>Хранит роль пользователя в IT-отделе (у роли пометка ПринадлежитITОтделу)</comment>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаПоУмолчанию</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРабочийСтол</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиОповещений</name>
    <attributes>
      <name>КатегорияОповещения</name>
      <type>
        <types>EnumRef.КатегорииСообщенийПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещениеВРабочийСтол</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтправки</name>
      <type>
        <types>EnumRef.ЧастотаОповещенийПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>СистемаВзаимодействия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/РолиУчастников/РолиУчастников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиУчастников</name>
  <comment>Список возможных ролей участников</comment>
  <predefined>
    <items>
      <name>Автор</name>
      <description>Автор</description>
    </items>
    <items>
      <name>ВладелецПродукта</name>
      <description>Владелец продукта</description>
    </items>
    <items>
      <name>ВсеРоли</name>
      <description>Все роли</description>
    </items>
    <items>
      <name>Заказчик</name>
      <description>Заказчик</description>
    </items>
    <items>
      <name>Исполнитель</name>
      <description>Исполнитель</description>
    </items>
    <items>
      <name>Наблюдатель</name>
      <description>Наблюдатель</description>
    </items>
    <items>
      <name>Подписчик</name>
      <description>Подписчик</description>
    </items>
    <items>
      <name>ПредыдущийАвтор</name>
      <description>Предыдущий автор</description>
    </items>
    <items>
      <name>Ревьюер</name>
      <description>Ревьюер</description>
    </items>
    <items>
      <name>РуководительПроекта</name>
      <description>Руководитель проекта</description>
    </items>
    <items>
      <name>Тестировщик</name>
      <description>Тестировщик</description>
    </items>
    <items>
      <name>УчастникКомандыУправленияПроектом</name>
      <description>Участник команды управления проектом</description>
    </items>
  </predefined>
</mdclass:Catalog>

configuration/src/InformationRegisters/Участники/Forms/МножественныйВыбор/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыФормы();	
	УстановитьЗаголовкиЭлементов();	
	
	ИнтерфейсПриложения.УстановитьУсловноеОформлениеСпискаДоступныхЗначений(
		ЭтотОбъект, "ДоступныеПользователи.Избранное", "ДоступныеПользователиНаименование");
	
	ЗаполнитьСпискиПользователей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтрокаПоискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	// Установка отбора на основании значения в строке поиска
	ИнтерфейсПриложенияКлиент.УстановитьОтборПриИзмененииСтрокиПоиска(
		ЭтотОбъект, "ДоступныеПользователи", Текст, "Наименование");	
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)
	
	ИнтерфейсПриложенияКлиент.СброситьПоиск(ЭтотОбъект, "ДоступныеПользователи");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий таблицы "ВыбранныеПользователи"

&НаКлиенте
Процедура ВыбранныеПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ВыбранныеПользователиИсключить" Тогда
		НайденнаяСтрока = ВыбранныеПользователи.НайтиПоИдентификатору(ВыбраннаяСтрока);
		НайденнаяСтрока = ДоступныеПользователи.НайтиПоИдентификатору(НайденнаяСтрока.ИдентификаторСтрокиСписка);
		
		ИсключитьПользователя(НайденнаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий таблицы "ДоступныеПользователи"

&НаКлиенте
Процедура ДоступныеПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДоступныеПользователиНаименование" Тогда
		НайденнаяСтрока = ДоступныеПользователи.НайтиПоИдентификатору(ВыбраннаяСтрока);
		НайденнаяСтрока.Пометка = НЕ НайденнаяСтрока.Пометка;
		
		ОбработатьИзменениеСтрокиДоступныхПользователей(НайденнаяСтрока);
		
	ИначеЕсли Поле.Имя = "ДоступныеПользователиИзбранное" Тогда
		НайденнаяСтрока = ДоступныеПользователи.НайтиПоИдентификатору(ВыбраннаяСтрока);
		НайденнаяСтрока.Избранное = НЕ НайденнаяСтрока.Избранное;
		
		ОбщегоНазначенияВызовСервера.ОбработатьПометкуИзбранного(НайденнаяСтрока.Пользователь,
			НайденнаяСтрока.Избранное, "Пользователи");
		
		ДоступныеПользователи.Сортировать("Избранное УБЫВ, Наименование");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПользователиПометкаПриИзменении(Элемент)
	
	ОбработатьИзменениеСтрокиДоступныхПользователей(Элементы.ДоступныеПользователи.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьИзбранные(Команда)
	
	Для Каждого СтрокаТаблицы Из ДоступныеПользователи Цикл
		Если СтрокаТаблицы.Избранное Тогда
			Если НЕ СтрокаТаблицы.Пометка Тогда
				ДобавитьПользователя(СтрокаТаблицы);
			КонецЕсли;
		Иначе
			Если СтрокаТаблицы.Пометка Тогда
				ИсключитьПользователя(СтрокаТаблицы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоиск(Команда)
	
	ИнтерфейсПриложенияКлиент.СброситьПоиск(ЭтотОбъект, "ДоступныеПользователи");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	Результат = Новый Массив;
	
	Для Каждого Строка Из ВыбранныеПользователи Цикл
		Результат.Добавить(Строка.Пользователь);
	КонецЦикла;
	
	ЕстьИзменения = СохранитьИзмененияНаСервере(Результат);
	
	Закрыть(ЕстьИзменения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Управление пользователями в списках

&НаКлиенте
Процедура ДобавитьПользователя(СтрокаТаблицы)
	
	НоваяСтрокаВыбранных = ВыбранныеПользователи.Добавить();
	НоваяСтрокаВыбранных.Исключить = БиблиотекаКартинок.УдалитьЗначение;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрокаВыбранных, СтрокаТаблицы, "Пользователь, Наименование");
	
	СтрокаТаблицы.Пометка = Истина;
	
	СтрокаТаблицы.ИдентификаторСтрокиСписка = НоваяСтрокаВыбранных.ПолучитьИдентификатор();
	НоваяСтрокаВыбранных.ИдентификаторСтрокиСписка = СтрокаТаблицы.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьПользователя(СтрокаТаблицы)
	
	НайденнаяСтрока = ВыбранныеПользователи.НайтиПоИдентификатору(СтрокаТаблицы.ИдентификаторСтрокиСписка);
	Если НайденнаяСтрока <> Неопределено Тогда
		ВыбранныеПользователи.Удалить(НайденнаяСтрока);
	КонецЕсли;	
	
	СтрокаТаблицы.Пометка = Ложь;
	СтрокаТаблицы.ИдентификаторСтрокиСписка = -1;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСтрокиДоступныхПользователей(СтрокаТаблицы)
	
	Если СтрокаТаблицы.Пометка = Истина Тогда
		ДобавитьПользователя(СтрокаТаблицы);	
	Иначе
		ИсключитьПользователя(СтрокаТаблицы);	
	КонецЕсли;			
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Прочие процедуры и функции

&НаСервере
Процедура ДобавитьУчастников(Изменено, Знач ДобавляемыеПользователи)
	
	Если ДобавляемыеПользователи.Количество() > 0 Тогда	
		Для Каждого Пользователь Из ДобавляемыеПользователи Цикл	
			РегистрыСведений.Участники.Добавить(Объект, Пользователь, Роль, Истина);
		КонецЦикла;
		
		Изменено = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	
	Объект = Параметры.Объект;
	Роль = Параметры.Роль;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиПользователей()
		
	ВыбранныеПользователи.Очистить();
	ДоступныеПользователи.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст =
#Область ТекстЗапроса
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ИзбранныеПользователи.Объект КАК Справочник.Пользователи) КАК Пользователь
	|ПОМЕСТИТЬ ИзбранныеПользователи
	|ИЗ
	|	РегистрСведений.ИзбранныеОбъекты КАК ИзбранныеПользователи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ИзбранныеПользователи.Объект = Пользователи.Ссылка
	|			И (НЕ Пользователи.Недействителен)
	|			И (НЕ Пользователи.Служебный)
	|ГДЕ
	|	ИзбранныеПользователи.Владелец = &ТекущийПользователь
	|	И ИзбранныеПользователи.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.ТипыИзбранныхОбъектов.Пользователи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	ЛОЖЬ КАК Пометка
	|ПОМЕСТИТЬ ВсеВозможныеУчастники
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Участники КАК Участники
	|		ПО Пользователи.Ссылка = Участники.Пользователь
	|			И (Участники.Роль = &Роль)
	|			И (Участники.Объект = &Объект)
	|			И (НЕ Участники.Скрытый)
	|ГДЕ
	|	НЕ Пользователи.Недействителен
	|	И НЕ Пользователи.Служебный
	|	И Участники.Пользователь ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Участники.Пользователь,
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.Участники КАК Участники
	|ГДЕ
	|	НЕ Участники.Скрытый
	|	И Участники.Объект = &Объект
	|	И Участники.Роль = &Роль
	|	И Участники.Пользователь ССЫЛКА Справочник.Пользователи
	|	И ВЫБОР
	|			КОГДА &СуперПользователь
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Участники.Пользователь = &ТекущийПользователь
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Участники.Пользователь,
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.Участники КАК Участники
	|ГДЕ
	|	НЕ Участники.Скрытый
	|	И Участники.Объект = &Объект
	|	И Участники.Роль = &Роль
	|	И Участники.Пользователь ССЫЛКА Справочник.Пользователи
	|	И ВЫБОР
	|			КОГДА &СуперПользователь
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Участники.Автор = &ТекущийПользователь
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеВозможныеУчастники.Пользователь КАК Пользователь,
	|	ВсеВозможныеУчастники.Пометка КАК Пометка,
	|	Пользователи.Наименование КАК Наименование,
	|	-1 КАК ИдентификаторСтрокиСписка,
	|	ВЫБОР
	|		КОГДА ИзбранныеПользователи.Пользователь ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Избранное
	|ИЗ
	|	ВсеВозможныеУчастники КАК ВсеВозможныеУчастники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ВсеВозможныеУчастники.Пользователь = Пользователи.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИзбранныеПользователи КАК ИзбранныеПользователи
	|		ПО (Пользователи.Ссылка = ИзбранныеПользователи.Пользователь)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Избранное УБЫВ,
	|	Наименование";
#КонецОбласти
	
	// Подготовка параметров запроса	
	СуперПользователь = (РольДоступна("Администратор") ИЛИ РольДоступна("ПолныеПрава"));	

	// Установка параметров запроса
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Роль", Роль);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("СуперПользователь", СуперПользователь);
	
	// Запросы пакета:
	// 1 - Избранные пользователи
	// 3 - Список доступных пользователей
	РезультатЗапроса = Запрос.Выполнить();
		
	// Формирование списка доступных пользователей
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			// Заполнение общей таблицы пользователей
			НоваяСтрокаДоступных = ДоступныеПользователи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДоступных, Выборка, 
				"Пометка, Пользователь, Наименование, Избранное, ИдентификаторСтрокиСписка");
			
			Если Выборка.Пометка = Истина Тогда
				НоваяСтрокаВыбранных = ВыбранныеПользователи.Добавить();
				НоваяСтрокаВыбранных.Исключить = БиблиотекаКартинок.УдалитьЗначение;
				
				НоваяСтрокаВыбранных.ИдентификаторСтрокиСписка = НоваяСтрокаДоступных.ПолучитьИдентификатор();
				НоваяСтрокаДоступных.ИдентификаторСтрокиСписка = НоваяСтрокаВыбранных.ПолучитьИдентификатор();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрокаВыбранных, Выборка, "Пользователь, Наименование");
				
				// Сохранение изначально выбранных значений
				НачальныйВыбор.Добавить(Выборка.Пользователь);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьИзмененияНаСервере(Знач ДобавляемыеПользователи)
	
	Изменено = Ложь;
	УдаляемыеПользователи = Новый Массив;
	
	ПодготовитьНаборИзмененныхДанных(ДобавляемыеПользователи, УдаляемыеПользователи);
	
	НачатьТранзакцию();
	Попытка
		УдалитьУчастников(Изменено, УдаляемыеПользователи);
		ДобавитьУчастников(Изменено, ДобавляемыеПользователи);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию(); 
		ЗаписьЖурналаРегистрации("Регистр сведений Участники: множественный подбор", 
			УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось изменить участников.");
		Изменено = Ложь;
	КонецПопытки;
	
	Возврат Изменено;
		
КонецФункции

&НаСервере
Процедура ПодготовитьНаборИзмененныхДанных(Знач ДобавляемыеПользователи, Знач УдаляемыеПользователи)
	
	Для Каждого Пользователь Из НачальныйВыбор Цикл
		НайденноеЗначение = ДобавляемыеПользователи.Найти(Пользователь.Значение);
		
		Если НайденноеЗначение = Неопределено Тогда
			УдаляемыеПользователи.Добавить(Пользователь.Значение);
		Иначе
			ДобавляемыеПользователи.Удалить(НайденноеЗначение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УдалитьУчастников(Изменено, Знач УдаляемыеПользователи)
	
	Если УдаляемыеПользователи.Количество() > 0 Тогда
		Для Каждого Пользователь Из УдаляемыеПользователи Цикл	
			РегистрыСведений.Участники.Изменить(Объект, Пользователь, Роль, Ложь, Истина, , Истина);
		КонецЦикла;
		
		Изменено = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиЭлементов()
	
	Если Роль = Справочники.РолиУчастников.Наблюдатель Тогда
		Заголовок = "Наблюдатели";
		Элементы.НадписьДобавитьПользователей.Заголовок = "Доступные наблюдатели";
		Элементы.НадписьВыбранныеПользователи.Заголовок = "Выбранные наблюдатели";
		
	ИначеЕсли Роль = Справочники.РолиУчастников.УчастникКомандыУправленияПроектом Тогда
		Заголовок = "Участники команды управления проектом";
		Элементы.НадписьДобавитьПользователей.Заголовок = "Доступные участники";
		Элементы.НадписьВыбранныеПользователи.Заголовок = "Выбранные участники";
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти
